




a = input("Исправили проблему? ")
a1 = "Перезагрузите компьютер и попробуйте подключиться"
a2 = "Перезагрузите маршрутизатор и попробуйте еще раз"
a3 = "Убедитесь, что кабели в исправны"
a4 = "Переместите маршрутизатор на новое место."
a5 = "Замените роутер, скорее всего он неисправен."
a6 = "Отлично"
sps = ["нет"]
if a in sps:
    print()
    print(a1)
    print()
if a in sps:
    a = input("Исправили проблему? ")
    print()
    print(a2)
    print()
if a in sps:
    a = input("Исправили проблему? ")
    print()
    print(a3)
    print()
if a in sps:
    a = input("Исправили проблему? ")
    print()
    print(a4)
    print()
if a in sps:
    a = input("Исправили проблему? ")
    print()
    print(a5)
else:
    if a == "да":
        print(a6)










              







    
    

 







    

    

