print("Есть ли в группе вегетарианцы, веганцы или безглютеновые?")

x = input("Вегетарианцы?:     ")
y = input("Веганцы?:   ")
z = input("Безглютеновые?:  ")


print("Вот список ваших ресторанов: ")


if x == "да" and y == "да" and z == "да":
    print("Кухня шеф повара: ")
    print("Кафе за углом: ")

elif x == "да" or y == "да" and z == "да":
    print("Центральная пиццерия: ")
    print("Кафе за углом: ")
    print("Кухня шеф повара: ")

elif x == "да" and y == "да" or z == "да":
    print("Центральная пиццерия: ")
    print("Кафе за углом: ")
    print("Кухня шеф повара: ")

elif x == "да" or z == "да" and y == "да":
    print("Кафе за углом: ")
    print("Кухня шеф повара: ")

elif x == "да" or z == "да" or y == "да":
    print("Центральная пиццерия: ")
    print("Кафе за углом: ")
    print("Кафе за углом: ")
    print("Блюда от итальянской мамы")


    

   


    












              







    
    

 







    

    

