
const = "Да"

while const == "Да" or const == "да" :
    print("температура по фарингейту и цельсию равна:")
    print("__________________________________________")
    for c in range(0,21):
        f = (9/5)*c+32
    
        print(f"   {f:.2f}               {c:.2f}      ")

    const = input("Введите да если хотите повторить цикл:   ")
    


 
    

    

    
        



    
    











              







    
    

 







    

    

