
def main():


    x = open("golf.html","w")
    
    print("Введите свое имя:  ")
    name = input ("   ")
    opis = "Моя специализация - информатика, я являюсь членом джаз клуба и надеюсь"\
      "стать разработчиком програмного обеспечения для машин, логики данных и прочего"

    x.write(f"{name}\n")
    x.write(f"{opis}\n")
    print("данные записаны в файл golf.html ")

    x.close()


    
  

if __name__ == "__main__":
  main()




 
      

  


 
  

            
        

    
    
    
    
   

     
   
    
   
                       


    





    


    

    


          
        
    





        












              







    
    

 







    

    

