Python 3.11.2 (tags/v3.11.2:878ead1, Feb  7 2023, 16:38:35) [MSC v.1934 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license()" for more information.

================= RESTART: C:\Users\denis\Desktop\IT\test264.py ================
Введите имя файла
строка номер № 1 : 86850343

строка номер № 2 : 88065952

строка номер № 3 : 89381968

строка номер № 4 : 89536251

строка номер № 5 : 89714939

строка номер № 6 : 89826424

строка номер № 7 : 90124775

строка номер № 8 : 90672109

строка номер № 9 : 91408453

строка номер № 10 : 92438737

строка номер № 11 : 93361277

строка номер № 12 : 93890243

строка номер № 13 : 94372638

строка номер № 14 : 94759578

строка номер № 15 : 95079649

строка номер № 16 : 95439651

строка номер № 17 : 95611217

строка номер № 18 : 95980818

строка номер № 19 : 96336673

строка номер № 20 : 96581524

строка номер № 21 : 97041824

строка номер № 22 : 97379048

строка номер № 23 : 97672500

строка номер № 24 : 98066518

строка номер № 25 : 98479598

строка номер № 26 : 98934553

строка номер № 27 : 99246321

строка номер № 28 : 99431136

строка номер № 29 : 99835823

строка номер № 30 : 100049946

строка номер № 31 : 100234498

строка номер № 32 : 100568960

строка номер № 33 : 100806870

строка номер № 34 : 101097750

строка номер № 35 : 101820859

строка номер № 36 : 102455417

строка номер № 37 : 103013163

строка номер № 38 : 103523365

строка номер № 39 : 104177442

строка номер № 40 : 104757015

строка номер № 41 : 105145703

строка номер № 42 : 105694237

строка номер № 43 : 106140898

строка номер № 44 : 107246430

строка номер № 45 : 109272544

строка номер № 46 : 111539027

строка номер № 47 : 112522852

строка номер № 48 : 113783213

строка номер № 49 : 114620610

строка номер № 50 : 116036567

строка номер № 51 : 117421727

строка номер № 52 : 119134533

строка номер № 53 : 120378586

строка номер № 54 : 121554027

строка номер № 55 : 121817833

строка номер № 56 : 122730767

строка номер № 57 : 123673909

строка номер № 58 : 124747226

