
def main():

    date = "13/01/1981"

    x = date.split("/")

    if x[1] == "01":
        x[1]= "январь"
    elif x[1] == "02":
        x[1]= "февраль"
    elif x[1] == "03":
        x[1]= "март"
    elif x[1] == "04":
        x[1]= "апрель"
    elif x[1] == "05":
        x[1]= "май"
    elif x[1] == "06":
        x[1]= "июнь"
    elif x[1] == "07":
        x[1]= "июль"
    elif x[1] == "08":
        x[1]= "август"
    elif x[1] == "09":
        x[1]= "сентябрь"
    elif x[1] == "10":
        x[1]= "октябрь"
    elif x[1] == "11":
        x[1]= "ноябрь"
    elif x[1] == "12":
        x[1]= "декабрь"

    print(x[0])
    print(x[1])
    print(x[2])


    
        
    
   
    


    

    
        
        

if __name__ == "__main__":
  main()


                            
 
                                

                               
        
    

    
     


        

  

    









    
    
    
    
       

 


 


            
        

    
     
    
    
   

     
   
    
   
                       


    





    


    

    


          
        
    





        












              







    
    

 







    

    

