
def main():


    morze = {'a': '•—', 'b': '—•••', 'c': '—•—•', 'd': '—••',   
     'e': '•', 'f': '••—•', 'g': '——•', 'h': '••••',
     'i': '••', 'j': '•———', 'k': '—•—', 'l': '•—••',
     'm': '——', 'n': '—•', 'o': '———', 'p': '•——•',
     'q': '——•—', 'r': '•—•', 's': '•••', 't': '—',
     'u': '••—', 'v': '•••—', 'w': '•——', 'x': '—••—',
     'y': '—•——', 'z': '——••'}

    print("Введите строковое значение из азбуки Морзе")
    x = input().lower().split()
    print(x)
    
    for word in x:
        print(word)
        out = ""
        for w in word:
            out += morze[w] + "    "
        print(out)
        
        

    

    
        
   
            
if __name__ == "__main__":
  main()

                            
 
                                

                               
        
    

    
     


        

  

    









    
    
    
    
       

 


 


            
        

    
     
    
    
   

     
   
    
   
                       


    





    


    

    


          
        
    





        












              







    
    

 







    

    

